БухЭксп/InformationRegisters/СобытияЭксплуатацииТСПИоТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияЭксплуатацииТСПИоТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВременнаяМетка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСобытия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/СобытияЭксплуатацииТСПИоТ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Менеджер = "РегистрСведений.СобытияЭксплуатацииТСПИоТ";
	МенеджерОборудованияВызовСервераПереопределяемый.ПриЗаполненииОграниченияДоступа(Менеджер, Ограничение);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Записать событие эксплуатации ТС ПИоТ	
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование
// 
Процедура ЗаписатьСобытиеЭксплуатацииТСПИоТ(ПодключаемоеОборудование, ВременнаяМетка, СобытиеЭксплуатации) Экспорт
	
	Если Не ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		Возврат;
	КонецЕсли;          
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СобытиеЭксплуатации);
	СобытиеОбъект = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	МенеджерЗаписи = СоздатьНаборЗаписей();
	Запись = МенеджерЗаписи.Добавить();       
	Запись.ПодключаемоеОборудование = ПодключаемоеОборудование; 
	Запись.ИдентификаторСобытия = Новый УникальныйИдентификатор();   
	Если СобытиеОбъект.Свойство("event_code") Тогда
		Запись.КодСобытия = СобытиеОбъект.event_code;
	КонецЕсли;    
	Если СобытиеОбъект.Свойство("tsp_conf_report") Тогда
		Запись.КодСобытия = "tsp_conf_report";
	КонецЕсли;    
	Запись.ВременнаяМетка = ВременнаяМетка;
	Запись.Событие = ОбщегоНазначенияБПО.ФорматироватьJSON(СобытиеЭксплуатации);
	МенеджерЗаписи.Записать(Ложь);          
	
КонецПроцедуры           

// Очищает cобытия эксплуатации ТС ПИоТ для указанного подключаемого оборудования.
//
// Параметры:
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - 
//     ссылка на подключаемое оборудование, для которого необходимо очистить архив логов
//
Процедура ОчиститьСобытияЭксплуатацииТСПИоТ(ПодключаемоеОборудование) Экспорт
	
	Если Не ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		ВызватьИсключение НСтр("ru = 'При очистке cобытия эсплуатации ТС ПИоТ, не указано подключаемое оборудование.'");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ПодключаемоеОборудование.Установить(ПодключаемоеОборудование); 
	Набор.Записать(Истина);
	
КонецПроцедуры

Функция СтрокаЗаписиСобытия(Запись) Экспорт
	
	ДатаЗаписи = Формат(ОбщегоНазначенияБПО.ВременнаяМеткаВДату(Запись.ВременнаяМетка), "ДФ='dd.MM.yyyy HH:mm:ss'");
	   
	ТекстЗаписи = СтрШаблон("%1 (%2): %3", Формат(Запись.ВременнаяМетка, "ЧГ=0"), ДатаЗаписи, Запись.КодСобытия) 
		+ Символы.ПС 
		+ Запись.Событие 
		+ Символы.ПС;
	
	Возврат ТекстЗаписи;
	
КонецФункции

// Архив cобытия эксплуатации
// Параметры:
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - 
//     ссылка на подключаемое оборудование, для которого необходимо очистить архив логов
//
Функция АрхивСобытияЭксплуатации(ПодключаемоеОборудование = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СобытияЭксплуатацииТСПИоТ.ВременнаяМетка КАК ВременнаяМетка,
		|	СобытияЭксплуатацииТСПИоТ.КодСобытия КАК КодСобытия,
		|	СобытияЭксплуатацииТСПИоТ.Событие КАК Событие
		|ИЗ
		|	РегистрСведений.СобытияЭксплуатацииТСПИоТ КАК СобытияЭксплуатацииТСПИоТ
		|ГДЕ
		|	СобытияЭксплуатацииТСПИоТ.ПодключаемоеОборудование = &Оборудование
		|УПОРЯДОЧИТЬ ПО ВременнаяМетка";
	
	Запрос.УстановитьПараметр("Оборудование", ПодключаемоеОборудование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Данные = Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтрокаДанных = ПолучитьДвоичныеДанныеИзСтроки(СтрокаЗаписиСобытия(Выборка));
		Данные.Добавить(СтрокаДанных);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаАрхива", ТекущаяДатаСеанса());
	Результат.Вставить("ДанныеАрхива", СоединитьДвоичныеДанные(Данные));
	Результат.Вставить("ЭтоАрхив", Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
